Tekla.Structures.Drawing.AngleDimensionAttributes
The AngleDimensionAttributes class contains the attributes for angle dimensions.
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
AngleDimensionAttributes attributes = new AngleDimensionAttributes("MyAttributes");
}
}

Tekla.Structures.Drawing.AngleDimensionAttributes.Type
The type of the angle.

Tekla.Structures.Drawing.AngleDimensionAttributes.TriangleBase
Gets or sets the triangle base length which controls the base dimension
shown for bevel dimensions (only if Type is AngleTypes.Triangle).

Tekla.Structures.Drawing.AngleDimensionAttributes.#ctor
Creates a new angle dimension attributes instance which loads standard attributes.

Tekla.Structures.Drawing.AngleDimensionAttributes.#ctor(System.Boolean)
Creates a new angle dimension attributes instance which loads standard attributes.
SkipLoadingAttributes: If it set to true attributes won't be lodaded.

Tekla.Structures.Drawing.AngleDimensionAttributes.#ctor(System.String)
Creates a new angle dimension attributes instance that loads the specified attributes.
AttributesFile: The attributes file's filename.

Tekla.Structures.Drawing.AngleDimensionAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.AngleDimensionAttributes.LoadAttributes(System.String)
Loads attributes from the attribute file.
AttributeFile: The attribute file's filename.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.